[Survived] BlockStatement
backend/dataService.js:7:32
 const fs = require('fs');
 
 class DataService {
-    constructor(dbPath = null) {
-        const dataDir = path.join(__dirname, 'data');
-        if (!fs.existsSync(dataDir)) {
-            fs.mkdirSync(dataDir, { recursive: true });
-        }
-        const finalPath = dbPath || path.join(dataDir, 'apk.db');
-        this.db = new Database(finalPath);
-        this.db.pragma('journal_mode = DELETE');
-        this.initTables();
-    }
+    constructor(dbPath = null) {}
 
     initTables() {

[NoCoverage] BlockStatement
backend/dataService.js:9:38
 class DataService {
     constructor(dbPath = null) {
         const dataDir = path.join(__dirname, 'data');
-        if (!fs.existsSync(dataDir)) {
-            fs.mkdirSync(dataDir, { recursive: true });
-        }
+        if (!fs.existsSync(dataDir)) {}
         const finalPath = dbPath || path.join(dataDir, 'apk.db');
         this.db = new Database(finalPath);

[Survived] ConditionalExpression
backend/dataService.js:9:13
 class DataService {
     constructor(dbPath = null) {
         const dataDir = path.join(__dirname, 'data');
-        if (!fs.existsSync(dataDir)) {
+        if (true) {
             fs.mkdirSync(dataDir, { recursive: true });
         }

[NoCoverage] BooleanLiteral
backend/dataService.js:10:48
     constructor(dbPath = null) {
         const dataDir = path.join(__dirname, 'data');
         if (!fs.existsSync(dataDir)) {
-            fs.mkdirSync(dataDir, { recursive: true });
+            fs.mkdirSync(dataDir, { recursive: false });
         }
         const finalPath = dbPath || path.join(dataDir, 'apk.db');

[Survived] LogicalOperator
backend/dataService.js:12:27
         if (!fs.existsSync(dataDir)) {
             fs.mkdirSync(dataDir, { recursive: true });
         }
-        const finalPath = dbPath || path.join(dataDir, 'apk.db');
+        const finalPath = dbPath && path.join(dataDir, 'apk.db');
         this.db = new Database(finalPath);
         this.db.pragma('journal_mode = DELETE');

[Survived] StringLiteral
backend/dataService.js:61:13
 
         // Migrations for existing databases
         const migrations = [
-            'ALTER TABLE files ADD COLUMN ip_address TEXT',
+            "",
             'ALTER TABLE files ADD COLUMN assignment_file_id INTEGER',
             'ALTER TABLE files ADD COLUMN deadline TEXT',

[Survived] BlockStatement
backend/dataService.js:66:39
             'ALTER TABLE files ADD COLUMN deadline TEXT',
             'ALTER TABLE files ADD COLUMN assignment_password TEXT DEFAULT ""'
         ];
-        for (const sql of migrations) {
-            try { this.db.prepare(sql).run(); } catch (e) { /* column exists */ }
-        }
+        for (const sql of migrations) {}
 
         // Migrate existing teacher course codes into classes table

[Survived] BlockStatement
backend/dataService.js:67:17
             'ALTER TABLE files ADD COLUMN assignment_password TEXT DEFAULT ""'
         ];
         for (const sql of migrations) {
-            try { this.db.prepare(sql).run(); } catch (e) { /* column exists */ }
+            try {} catch (e) { /* column exists */ }
         }
 

[Survived] BlockStatement
backend/dataService.js:74:32
         this._migrateClassesFromUsers();
     }
 
-    _migrateClassesFromUsers() {
-        try {
-            const teachers = this.db.prepare("SELECT id, course_codes FROM users WHERE role = 'teacher'").all();
-            for (const t of teachers) {
-                const codes = (t.course_codes || '').split(',').filter(c => c.trim());
-                for (const code of codes) {
-                    const exists = this.db.prepare('SELECT id FROM classes WHERE course_code = ?').get(code.trim());
-                    if (!exists) {
-                        this.db.prepare('INSERT OR IGNORE INTO classes (course_code, teacher_id, password, created_at) VALUES (?, ?, ?, ?)').run(
-                            code.trim(), t.id, '', new Date().toISOString()
-                        );
-                    }
-                }
-            }
-        } catch (e) { /* safe to ignore on first run */ }
-    }
+    _migrateClassesFromUsers() {}
 
     // ============ USER METHODS ============

[Survived] BlockStatement
backend/dataService.js:75:13
     }
 
     _migrateClassesFromUsers() {
-        try {
-            const teachers = this.db.prepare("SELECT id, course_codes FROM users WHERE role = 'teacher'").all();
-            for (const t of teachers) {
-                const codes = (t.course_codes || '').split(',').filter(c => c.trim());
-                for (const code of codes) {
-                    const exists = this.db.prepare('SELECT id FROM classes WHERE course_code = ?').get(code.trim());
-                    if (!exists) {
-                        this.db.prepare('INSERT OR IGNORE INTO classes (course_code, teacher_id, password, created_at) VALUES (?, ?, ?, ?)').run(
-                            code.trim(), t.id, '', new Date().toISOString()
-                        );
-                    }
-                }
-            }
-        } catch (e) { /* safe to ignore on first run */ }
+        try {} catch (e) { /* safe to ignore on first run */ }
     }
 

[Survived] BlockStatement
backend/dataService.js:77:39
     _migrateClassesFromUsers() {
         try {
             const teachers = this.db.prepare("SELECT id, course_codes FROM users WHERE role = 'teacher'").all();
-            for (const t of teachers) {
-                const codes = (t.course_codes || '').split(',').filter(c => c.trim());
-                for (const code of codes) {
-                    const exists = this.db.prepare('SELECT id FROM classes WHERE course_code = ?').get(code.trim());
-                    if (!exists) {
-                        this.db.prepare('INSERT OR IGNORE INTO classes (course_code, teacher_id, password, created_at) VALUES (?, ?, ?, ?)').run(
-                            code.trim(), t.id, '', new Date().toISOString()
-                        );
-                    }
-                }
-            }
+            for (const t of teachers) {}
         } catch (e) { /* safe to ignore on first run */ }
     }

[Survived] MethodExpression
backend/dataService.js:78:31
         try {
             const teachers = this.db.prepare("SELECT id, course_codes FROM users WHERE role = 'teacher'").all();
             for (const t of teachers) {
-                const codes = (t.course_codes || '').split(',').filter(c => c.trim());
+                const codes = (t.course_codes || '').split(',');
                 for (const code of codes) {
                     const exists = this.db.prepare('SELECT id FROM classes WHERE course_code = ?').get(code.trim());

[Survived] ArrowFunction
backend/dataService.js:78:72
         try {
             const teachers = this.db.prepare("SELECT id, course_codes FROM users WHERE role = 'teacher'").all();
             for (const t of teachers) {
-                const codes = (t.course_codes || '').split(',').filter(c => c.trim());
+                const codes = (t.course_codes || '').split(',').filter(() => undefined);
                 for (const code of codes) {
                     const exists = this.db.prepare('SELECT id FROM classes WHERE course_code = ?').get(code.trim());

[Survived] BlockStatement
backend/dataService.js:79:43
             const teachers = this.db.prepare("SELECT id, course_codes FROM users WHERE role = 'teacher'").all();
             for (const t of teachers) {
                 const codes = (t.course_codes || '').split(',').filter(c => c.trim());
-                for (const code of codes) {
-                    const exists = this.db.prepare('SELECT id FROM classes WHERE course_code = ?').get(code.trim());
-                    if (!exists) {
-                        this.db.prepare('INSERT OR IGNORE INTO classes (course_code, teacher_id, password, created_at) VALUES (?, ?, ?, ?)').run(
-                            code.trim(), t.id, '', new Date().toISOString()
-                        );
-                    }
-                }
+                for (const code of codes) {}
             }
         } catch (e) { /* safe to ignore on first run */ }

[Survived] MethodExpression
backend/dataService.js:80:104
             for (const t of teachers) {
                 const codes = (t.course_codes || '').split(',').filter(c => c.trim());
                 for (const code of codes) {
-                    const exists = this.db.prepare('SELECT id FROM classes WHERE course_code = ?').get(code.trim());
+                    const exists = this.db.prepare('SELECT id FROM classes WHERE course_code = ?').get(code);
                     if (!exists) {
                         this.db.prepare('INSERT OR IGNORE INTO classes (course_code, teacher_id, password, created_at) VALUES (?, ?, ?, ?)').run(

[NoCoverage] BlockStatement
backend/dataService.js:81:34
                 const codes = (t.course_codes || '').split(',').filter(c => c.trim());
                 for (const code of codes) {
                     const exists = this.db.prepare('SELECT id FROM classes WHERE course_code = ?').get(code.trim());
-                    if (!exists) {
-                        this.db.prepare('INSERT OR IGNORE INTO classes (course_code, teacher_id, password, created_at) VALUES (?, ?, ?, ?)').run(
-                            code.trim(), t.id, '', new Date().toISOString()
-                        );
-                    }
+                    if (!exists) {}
                 }
             }

[Survived] ConditionalExpression
backend/dataService.js:81:25
                 const codes = (t.course_codes || '').split(',').filter(c => c.trim());
                 for (const code of codes) {
                     const exists = this.db.prepare('SELECT id FROM classes WHERE course_code = ?').get(code.trim());
-                    if (!exists) {
+                    if (false) {
                         this.db.prepare('INSERT OR IGNORE INTO classes (course_code, teacher_id, password, created_at) VALUES (?, ?, ?, ?)').run(
                             code.trim(), t.id, '', new Date().toISOString()

[NoCoverage] MethodExpression
backend/dataService.js:83:29
                     const exists = this.db.prepare('SELECT id FROM classes WHERE course_code = ?').get(code.trim());
                     if (!exists) {
                         this.db.prepare('INSERT OR IGNORE INTO classes (course_code, teacher_id, password, created_at) VALUES (?, ?, ?, ?)').run(
-                            code.trim(), t.id, '', new Date().toISOString()
+                            code, t.id, '', new Date().toISOString()
                         );
                     }

[Survived] BlockStatement
backend/dataService.js:93:74
 
     // ============ USER METHODS ============
 
-    async registerUser(name, username, role, password, courseCodes = []) {
-        try {
-            const existingUser = this.db.prepare('SELECT id FROM users WHERE username = ?').get(username);
-            if (existingUser) throw new Error('Username already exists');
-
-            const hashedPassword = await bcrypt.hash(password, 10);
-            const courseCodesStr = courseCodes.join(',');
-
-            const stmt = this.db.prepare('INSERT INTO users (name, username, role, password, course_codes) VALUES (?, ?, ?, ?, ?)');
-            const info = stmt.run(name, username, role, hashedPassword, courseCodesStr);
-
-            return { id: info.lastInsertRowid, name, username, role, course_codes: courseCodesStr };
-        } catch (error) {
-            console.error('Error registering user:', error);
-            throw error;
-        }
-    }
+    async registerUser(name, username, role, password, courseCodes = []) {}
 
     async loginUser(username, password) {

[Survived] ArrayDeclaration
backend/dataService.js:93:70
 
     // ============ USER METHODS ============
 
-    async registerUser(name, username, role, password, courseCodes = []) {
+    async registerUser(name, username, role, password, courseCodes = ["Stryker was here"]) {
         try {
             const existingUser = this.db.prepare('SELECT id FROM users WHERE username = ?').get(username);

[Survived] BlockStatement
backend/dataService.js:94:13
     // ============ USER METHODS ============
 
     async registerUser(name, username, role, password, courseCodes = []) {
-        try {
-            const existingUser = this.db.prepare('SELECT id FROM users WHERE username = ?').get(username);
-            if (existingUser) throw new Error('Username already exists');
-
-            const hashedPassword = await bcrypt.hash(password, 10);
-            const courseCodesStr = courseCodes.join(',');
-
-            const stmt = this.db.prepare('INSERT INTO users (name, username, role, password, course_codes) VALUES (?, ?, ?, ?, ?)');
-            const info = stmt.run(name, username, role, hashedPassword, courseCodesStr);
-
-            return { id: info.lastInsertRowid, name, username, role, course_codes: courseCodesStr };
-        } catch (error) {
+        try {} catch (error) {
             console.error('Error registering user:', error);
             throw error;

[Killed] ConditionalExpression
backend/dataService.js:96:17
     async registerUser(name, username, role, password, courseCodes = []) {
         try {
             const existingUser = this.db.prepare('SELECT id FROM users WHERE username = ?').get(username);
-            if (existingUser) throw new Error('Username already exists');
+            if (true) throw new Error('Username already exists');
 
             const hashedPassword = await bcrypt.hash(password, 10);
killedBy: APK Portal API Integration Tests Authentication Module should register a new teacher
statusReason: expected 400 to equal 200

[Survived] ConditionalExpression
backend/dataService.js:96:17
     async registerUser(name, username, role, password, courseCodes = []) {
         try {
             const existingUser = this.db.prepare('SELECT id FROM users WHERE username = ?').get(username);
-            if (existingUser) throw new Error('Username already exists');
+            if (false) throw new Error('Username already exists');
 
             const hashedPassword = await bcrypt.hash(password, 10);

[NoCoverage] BlockStatement
backend/dataService.js:105:25
             const info = stmt.run(name, username, role, hashedPassword, courseCodesStr);
 
             return { id: info.lastInsertRowid, name, username, role, course_codes: courseCodesStr };
-        } catch (error) {
-            console.error('Error registering user:', error);
-            throw error;
-        }
+        } catch (error) {}
     }
 

[Killed] BlockStatement
backend/dataService.js:111:41
         }
     }
 
-    async loginUser(username, password) {
-        try {
-            const user = this.db.prepare('SELECT * FROM users WHERE username = ?').get(username);
-            if (!user) throw new Error('Invalid username or password');
-
-            const isMatch = await bcrypt.compare(password, user.password);
-            if (!isMatch) throw new Error('Invalid username or password');
-
-            return { id: user.id, name: user.name, username: user.username, role: user.role, course_codes: user.course_codes };
-        } catch (error) {
-            console.error('Error logging in:', error);
-            throw error;
-        }
-    }
+    async loginUser(username, password) {}
 
     getUserById(userId) {
killedBy: APK Portal API Integration Tests Authentication Module should login as teacher and return a JWT
statusReason: expected 401 to equal 200

[Killed] BlockStatement
backend/dataService.js:112:13
     }
 
     async loginUser(username, password) {
-        try {
-            const user = this.db.prepare('SELECT * FROM users WHERE username = ?').get(username);
-            if (!user) throw new Error('Invalid username or password');
-
-            const isMatch = await bcrypt.compare(password, user.password);
-            if (!isMatch) throw new Error('Invalid username or password');
-
-            return { id: user.id, name: user.name, username: user.username, role: user.role, course_codes: user.course_codes };
-        } catch (error) {
+        try {} catch (error) {
             console.error('Error logging in:', error);
             throw error;
killedBy: APK Portal API Integration Tests Authentication Module should login as teacher and return a JWT
statusReason: expected 401 to equal 200

[Killed] BooleanLiteral
backend/dataService.js:114:17
     async loginUser(username, password) {
         try {
             const user = this.db.prepare('SELECT * FROM users WHERE username = ?').get(username);
-            if (!user) throw new Error('Invalid username or password');
+            if (user) throw new Error('Invalid username or password');
 
             const isMatch = await bcrypt.compare(password, user.password);
killedBy: APK Portal API Integration Tests Authentication Module should login as teacher and return a JWT
statusReason: expected 401 to equal 200

[Killed] ConditionalExpression
backend/dataService.js:114:17
     async loginUser(username, password) {
         try {
             const user = this.db.prepare('SELECT * FROM users WHERE username = ?').get(username);
-            if (!user) throw new Error('Invalid username or password');
+            if (true) throw new Error('Invalid username or password');
 
             const isMatch = await bcrypt.compare(password, user.password);
killedBy: APK Portal API Integration Tests Authentication Module should login as teacher and return a JWT
statusReason: expected 401 to equal 200

[Killed] ConditionalExpression
backend/dataService.js:117:17
             if (!user) throw new Error('Invalid username or password');
 
             const isMatch = await bcrypt.compare(password, user.password);
-            if (!isMatch) throw new Error('Invalid username or password');
+            if (true) throw new Error('Invalid username or password');
 
             return { id: user.id, name: user.name, username: user.username, role: user.role, course_codes: user.course_codes };
killedBy: APK Portal API Integration Tests Authentication Module should login as teacher and return a JWT
statusReason: expected 401 to equal 200

[Killed] BooleanLiteral
backend/dataService.js:117:17
             if (!user) throw new Error('Invalid username or password');
 
             const isMatch = await bcrypt.compare(password, user.password);
-            if (!isMatch) throw new Error('Invalid username or password');
+            if (isMatch) throw new Error('Invalid username or password');
 
             return { id: user.id, name: user.name, username: user.username, role: user.role, course_codes: user.course_codes };
killedBy: APK Portal API Integration Tests Authentication Module should login as teacher and return a JWT
statusReason: expected 401 to equal 200

[Killed] ObjectLiteral
backend/dataService.js:119:20
             const isMatch = await bcrypt.compare(password, user.password);
             if (!isMatch) throw new Error('Invalid username or password');
 
-            return { id: user.id, name: user.name, username: user.username, role: user.role, course_codes: user.course_codes };
+            return {};
         } catch (error) {
             console.error('Error logging in:', error);
killedBy: APK Portal API Integration Tests Authentication Module should login as teacher and return a JWT
statusReason: expected 401 to equal 200

[NoCoverage] BlockStatement
backend/dataService.js:120:25
             if (!isMatch) throw new Error('Invalid username or password');
 
             return { id: user.id, name: user.name, username: user.username, role: user.role, course_codes: user.course_codes };
-        } catch (error) {
-            console.error('Error logging in:', error);
-            throw error;
-        }
+        } catch (error) {}
     }
 

[NoCoverage] StringLiteral
backend/dataService.js:121:27
 
             return { id: user.id, name: user.name, username: user.username, role: user.role, course_codes: user.course_codes };
         } catch (error) {
-            console.error('Error logging in:', error);
+            console.error("", error);
             throw error;
         }

[Killed] BlockStatement
backend/dataService.js:126:25
         }
     }
 
-    getUserById(userId) {
-        try {
-            return this.db.prepare('SELECT * FROM users WHERE id = ?').get(parseInt(userId));
-        } catch (error) {
-            console.error('Error getting user:', error);
-            throw new Error('Failed to retrieve user');
-        }
-    }
+    getUserById(userId) {}
 
     // ============ CLASS METHODS ============
killedBy: APK Portal API Integration Tests Classroom & Assignment Module should allow teacher to create a class
statusReason: expected 400 to equal 200

[Killed] BlockStatement
backend/dataService.js:127:13
     }
 
     getUserById(userId) {
-        try {
-            return this.db.prepare('SELECT * FROM users WHERE id = ?').get(parseInt(userId));
-        } catch (error) {
+        try {} catch (error) {
             console.error('Error getting user:', error);
             throw new Error('Failed to retrieve user');
killedBy: APK Portal API Integration Tests Classroom & Assignment Module should allow teacher to create a class
statusReason: expected 400 to equal 200

[NoCoverage] BlockStatement
backend/dataService.js:129:25
     getUserById(userId) {
         try {
             return this.db.prepare('SELECT * FROM users WHERE id = ?').get(parseInt(userId));
-        } catch (error) {
-            console.error('Error getting user:', error);
-            throw new Error('Failed to retrieve user');
-        }
+        } catch (error) {}
     }
 

[NoCoverage] StringLiteral
backend/dataService.js:130:27
         try {
             return this.db.prepare('SELECT * FROM users WHERE id = ?').get(parseInt(userId));
         } catch (error) {
-            console.error('Error getting user:', error);
+            console.error("", error);
             throw new Error('Failed to retrieve user');
         }

[NoCoverage] StringLiteral
backend/dataService.js:137:48
 
     // ============ CLASS METHODS ============
 
-    createClass(userId, courseCode, password = '') {
+    createClass(userId, courseCode, password = "Stryker was here!") {
         try {
             const user = this.getUserById(userId);

[Killed] BlockStatement
backend/dataService.js:138:13
     // ============ CLASS METHODS ============
 
     createClass(userId, courseCode, password = '') {
-        try {
-            const user = this.getUserById(userId);
-            if (!user) throw new Error('User not found');
-            if (user.role !== 'teacher') throw new Error('Only teachers can create classes');
-
-            // Check if class already exists
-            const existing = this.db.prepare('SELECT id FROM classes WHERE course_code = ?').get(courseCode.trim());
-            if (existing) throw new Error('Class with this code already exists');
-
-            // Insert into classes table
-            this.db.prepare('INSERT INTO classes (course_code, teacher_id, password, created_at) VALUES (?, ?, ?, ?)').run(
-                courseCode.trim(), parseInt(userId), password || '', new Date().toISOString()
-            );
-
-            // Also add to user's course_codes for backward compat
-            const codes = (user.course_codes || '').split(',').filter(c => c.trim());
-            if (!codes.includes(courseCode.trim())) {
-                codes.push(courseCode.trim());
-                this.db.prepare('UPDATE users SET course_codes = ? WHERE id = ?').run(codes.join(','), parseInt(userId));
-            }
-
-            return { courseCode: courseCode.trim(), message: 'Class created successfully' };
-        } catch (error) {
+        try {} catch (error) {
             console.error('Error creating class:', error);
             throw error;
killedBy: APK Portal API Integration Tests Classroom & Assignment Module should allow teacher to create a class
statusReason: Invalid value "undefined" for header "Authorization"

[Killed] BooleanLiteral
backend/dataService.js:140:17
     createClass(userId, courseCode, password = '') {
         try {
             const user = this.getUserById(userId);
-            if (!user) throw new Error('User not found');
+            if (user) throw new Error('User not found');
             if (user.role !== 'teacher') throw new Error('Only teachers can create classes');
 
killedBy: APK Portal API Integration Tests Classroom & Assignment Module should allow teacher to create a class
statusReason: expected 400 to equal 200

[Killed] ConditionalExpression
backend/dataService.js:140:17
     createClass(userId, courseCode, password = '') {
         try {
             const user = this.getUserById(userId);
-            if (!user) throw new Error('User not found');
+            if (true) throw new Error('User not found');
             if (user.role !== 'teacher') throw new Error('Only teachers can create classes');
 
killedBy: APK Portal API Integration Tests Classroom & Assignment Module should allow teacher to create a class
statusReason: Invalid value "undefined" for header "Authorization"

[Killed] ConditionalExpression
backend/dataService.js:141:17
         try {
             const user = this.getUserById(userId);
             if (!user) throw new Error('User not found');
-            if (user.role !== 'teacher') throw new Error('Only teachers can create classes');
+            if (false) throw new Error('Only teachers can create classes');
 
             // Check if class already exists
killedBy: APK Portal API Integration Tests Classroom & Assignment Module should allow teacher to create a class
statusReason: Invalid value "undefined" for header "Authorization"

[Killed] ConditionalExpression
backend/dataService.js:141:17
         try {
             const user = this.getUserById(userId);
             if (!user) throw new Error('User not found');
-            if (user.role !== 'teacher') throw new Error('Only teachers can create classes');
+            if (true) throw new Error('Only teachers can create classes');
 
             // Check if class already exists
killedBy: APK Portal API Integration Tests Classroom & Assignment Module should allow teacher to create a class
statusReason: expected 400 to equal 200

[Killed] MethodExpression
backend/dataService.js:144:98
             if (user.role !== 'teacher') throw new Error('Only teachers can create classes');
 
             // Check if class already exists
-            const existing = this.db.prepare('SELECT id FROM classes WHERE course_code = ?').get(courseCode.trim());
+            const existing = this.db.prepare('SELECT id FROM classes WHERE course_code = ?').get(courseCode);
             if (existing) throw new Error('Class with this code already exists');
 
killedBy: APK Portal API Integration Tests Classroom & Assignment Module should allow teacher to create a class
statusReason: Invalid value "undefined" for header "Authorization"

[Killed] ConditionalExpression
backend/dataService.js:145:17
 
             // Check if class already exists
             const existing = this.db.prepare('SELECT id FROM classes WHERE course_code = ?').get(courseCode.trim());
-            if (existing) throw new Error('Class with this code already exists');
+            if (true) throw new Error('Class with this code already exists');
 
             // Insert into classes table
killedBy: APK Portal API Integration Tests Classroom & Assignment Module should allow teacher to create a class
statusReason: expected 400 to equal 200

[Killed] ConditionalExpression
backend/dataService.js:145:17
 
             // Check if class already exists
             const existing = this.db.prepare('SELECT id FROM classes WHERE course_code = ?').get(courseCode.trim());
-            if (existing) throw new Error('Class with this code already exists');
+            if (false) throw new Error('Class with this code already exists');
 
             // Insert into classes table
killedBy: APK Portal API Integration Tests Classroom & Assignment Module should allow teacher to create a class
statusReason: Invalid value "undefined" for header "Authorization"

[Killed] ConditionalExpression
backend/dataService.js:149:54
 
             // Insert into classes table
             this.db.prepare('INSERT INTO classes (course_code, teacher_id, password, created_at) VALUES (?, ?, ?, ?)').run(
-                courseCode.trim(), parseInt(userId), password || '', new Date().toISOString()
+                courseCode.trim(), parseInt(userId), false, new Date().toISOString()
             );
 
killedBy: APK Portal API Integration Tests Classroom & Assignment Module should allow teacher to create a class
statusReason: expected 400 to equal 200

[Killed] LogicalOperator
backend/dataService.js:149:54
 
             // Insert into classes table
             this.db.prepare('INSERT INTO classes (course_code, teacher_id, password, created_at) VALUES (?, ?, ?, ?)').run(
-                courseCode.trim(), parseInt(userId), password || '', new Date().toISOString()
+                courseCode.trim(), parseInt(userId), password && '', new Date().toISOString()
             );
 
killedBy: APK Portal API Integration Tests Classroom & Assignment Module should allow teacher to create a class
statusReason: Invalid value "undefined" for header "Authorization"
