[Killed] ArrowFunction
backend/dataService.js:153:71
             );
 
             // Also add to user's course_codes for backward compat
-            const codes = (user.course_codes || '').split(',').filter(c => c.trim());
+            const codes = (user.course_codes || '').split(',').filter(() => undefined);
             if (!codes.includes(courseCode.trim())) {
                 codes.push(courseCode.trim());
killedBy: APK Portal API Integration Tests Classroom & Assignment Module should allow teacher to create a class
statusReason: Invalid value "undefined" for header "Authorization"

[Killed] ConditionalExpression
backend/dataService.js:153:28
             );
 
             // Also add to user's course_codes for backward compat
-            const codes = (user.course_codes || '').split(',').filter(c => c.trim());
+            const codes = (true).split(',').filter(c => c.trim());
             if (!codes.includes(courseCode.trim())) {
                 codes.push(courseCode.trim());
killedBy: APK Portal API Integration Tests Classroom & Assignment Module should allow teacher to create a class
statusReason: Invalid value "undefined" for header "Authorization"

[Killed] BlockStatement
backend/dataService.js:154:53
 
             // Also add to user's course_codes for backward compat
             const codes = (user.course_codes || '').split(',').filter(c => c.trim());
-            if (!codes.includes(courseCode.trim())) {
-                codes.push(courseCode.trim());
-                this.db.prepare('UPDATE users SET course_codes = ? WHERE id = ?').run(codes.join(','), parseInt(userId));
-            }
+            if (!codes.includes(courseCode.trim())) {}
 
             return { courseCode: courseCode.trim(), message: 'Class created successfully' };
killedBy: APK Portal API Integration Tests Classroom & Assignment Module should allow teacher to create a class
statusReason: Invalid value "undefined" for header "Authorization"

[Killed] ConditionalExpression
backend/dataService.js:154:17
 
             // Also add to user's course_codes for backward compat
             const codes = (user.course_codes || '').split(',').filter(c => c.trim());
-            if (!codes.includes(courseCode.trim())) {
+            if (true) {
                 codes.push(courseCode.trim());
                 this.db.prepare('UPDATE users SET course_codes = ? WHERE id = ?').run(codes.join(','), parseInt(userId));
killedBy: APK Portal API Integration Tests Classroom & Assignment Module should allow teacher to create a class
statusReason: Invalid value "undefined" for header "Authorization"

[Killed] MethodExpression
backend/dataService.js:155:28
             // Also add to user's course_codes for backward compat
             const codes = (user.course_codes || '').split(',').filter(c => c.trim());
             if (!codes.includes(courseCode.trim())) {
-                codes.push(courseCode.trim());
+                codes.push(courseCode);
                 this.db.prepare('UPDATE users SET course_codes = ? WHERE id = ?').run(codes.join(','), parseInt(userId));
             }
killedBy: APK Portal API Integration Tests Classroom & Assignment Module should allow teacher to create a class
statusReason: Invalid value "undefined" for header "Authorization"

[Killed] StringLiteral
backend/dataService.js:156:98
             const codes = (user.course_codes || '').split(',').filter(c => c.trim());
             if (!codes.includes(courseCode.trim())) {
                 codes.push(courseCode.trim());
-                this.db.prepare('UPDATE users SET course_codes = ? WHERE id = ?').run(codes.join(','), parseInt(userId));
+                this.db.prepare('UPDATE users SET course_codes = ? WHERE id = ?').run(codes.join(""), parseInt(userId));
             }
 
killedBy: APK Portal API Integration Tests Classroom & Assignment Module should allow teacher to create a class
statusReason: Invalid value "undefined" for header "Authorization"

[Killed] MethodExpression
backend/dataService.js:159:34
                 this.db.prepare('UPDATE users SET course_codes = ? WHERE id = ?').run(codes.join(','), parseInt(userId));
             }
 
-            return { courseCode: courseCode.trim(), message: 'Class created successfully' };
+            return { courseCode: courseCode, message: 'Class created successfully' };
         } catch (error) {
             console.error('Error creating class:', error);
killedBy: APK Portal API Integration Tests Classroom & Assignment Module should allow teacher to create a class
statusReason: Invalid value "undefined" for header "Authorization"

[Killed] StringLiteral
backend/dataService.js:159:62
                 this.db.prepare('UPDATE users SET course_codes = ? WHERE id = ?').run(codes.join(','), parseInt(userId));
             }
 
-            return { courseCode: courseCode.trim(), message: 'Class created successfully' };
+            return { courseCode: courseCode.trim(), message: "" };
         } catch (error) {
             console.error('Error creating class:', error);
killedBy: APK Portal API Integration Tests Classroom & Assignment Module should allow teacher to create a class
statusReason: Invalid value "undefined" for header "Authorization"

[NoCoverage] BlockStatement
backend/dataService.js:160:25
             }
 
             return { courseCode: courseCode.trim(), message: 'Class created successfully' };
-        } catch (error) {
-            console.error('Error creating class:', error);
-            throw error;
-        }
+        } catch (error) {}
     }
 

[Killed] ConditionalExpression
backend/dataService.js:169:17
     joinClass(userId, courseCode, password = '') {
         try {
             const user = this.getUserById(userId);
-            if (!user) throw new Error('User not found');
+            if (false) throw new Error('User not found');
             if (user.role !== 'student') throw new Error('Only students can join classes');
 
killedBy: APK Portal API Integration Tests Classroom & Assignment Module should allow student to join a class with password
statusReason: Invalid value "undefined" for header "Authorization"

[Killed] ConditionalExpression
backend/dataService.js:170:17
         try {
             const user = this.getUserById(userId);
             if (!user) throw new Error('User not found');
-            if (user.role !== 'student') throw new Error('Only students can join classes');
+            if (false) throw new Error('Only students can join classes');
 
             // Check class exists
killedBy: APK Portal API Integration Tests Classroom & Assignment Module should allow student to join a class with password
statusReason: Invalid value "undefined" for header "Authorization"

[Killed] EqualityOperator
backend/dataService.js:170:17
         try {
             const user = this.getUserById(userId);
             if (!user) throw new Error('User not found');
-            if (user.role !== 'student') throw new Error('Only students can join classes');
+            if (user.role === 'student') throw new Error('Only students can join classes');
 
             // Check class exists
killedBy: APK Portal API Integration Tests Classroom & Assignment Module should allow student to join a class with password
statusReason: Invalid value "undefined" for header "Authorization"

[Killed] MethodExpression
backend/dataService.js:173:92
             if (user.role !== 'student') throw new Error('Only students can join classes');
 
             // Check class exists
-            const cls = this.db.prepare('SELECT * FROM classes WHERE course_code = ?').get(courseCode.trim());
+            const cls = this.db.prepare('SELECT * FROM classes WHERE course_code = ?').get(courseCode);
             if (!cls) {
                 // Also check teacher course_codes for backward compat
killedBy: APK Portal API Integration Tests Classroom & Assignment Module should allow student to join a class with password
statusReason: Invalid value "undefined" for header "Authorization"

[Killed] ConditionalExpression
backend/dataService.js:174:17
 
             // Check class exists
             const cls = this.db.prepare('SELECT * FROM classes WHERE course_code = ?').get(courseCode.trim());
-            if (!cls) {
+            if (false) {
                 // Also check teacher course_codes for backward compat
                 const allTeachers = this.db.prepare("SELECT course_codes FROM users WHERE role = 'teacher'").all();
killedBy: APK Portal API Integration Tests Classroom & Assignment Module should allow student to join a class with password
statusReason: expected 400 to equal 200

[Killed] ConditionalExpression
backend/dataService.js:174:17
 
             // Check class exists
             const cls = this.db.prepare('SELECT * FROM classes WHERE course_code = ?').get(courseCode.trim());
-            if (!cls) {
+            if (true) {
                 // Also check teacher course_codes for backward compat
                 const allTeachers = this.db.prepare("SELECT course_codes FROM users WHERE role = 'teacher'").all();
killedBy: APK Portal API Integration Tests Classroom & Assignment Module should allow student to join a class with password
statusReason: Invalid value "undefined" for header "Authorization"

[NoCoverage] BooleanLiteral
backend/dataService.js:177:29
             if (!cls) {
                 // Also check teacher course_codes for backward compat
                 const allTeachers = this.db.prepare("SELECT course_codes FROM users WHERE role = 'teacher'").all();
-                let found = false;
+                let found = true;
                 for (const t of allTeachers) {
                     const codes = (t.course_codes || '').split(',').map(c => c.trim());

[NoCoverage] BlockStatement
backend/dataService.js:178:46
                 // Also check teacher course_codes for backward compat
                 const allTeachers = this.db.prepare("SELECT course_codes FROM users WHERE role = 'teacher'").all();
                 let found = false;
-                for (const t of allTeachers) {
-                    const codes = (t.course_codes || '').split(',').map(c => c.trim());
-                    if (codes.includes(courseCode.trim())) { found = true; break; }
-                }
+                for (const t of allTeachers) {}
                 if (!found) throw new Error('Class not found. Please check the course code.');
             }

[NoCoverage] ConditionalExpression
backend/dataService.js:179:36
                 const allTeachers = this.db.prepare("SELECT course_codes FROM users WHERE role = 'teacher'").all();
                 let found = false;
                 for (const t of allTeachers) {
-                    const codes = (t.course_codes || '').split(',').map(c => c.trim());
+                    const codes = (false).split(',').map(c => c.trim());
                     if (codes.includes(courseCode.trim())) { found = true; break; }
                 }

[NoCoverage] MethodExpression
backend/dataService.js:179:78
                 const allTeachers = this.db.prepare("SELECT course_codes FROM users WHERE role = 'teacher'").all();
                 let found = false;
                 for (const t of allTeachers) {
-                    const codes = (t.course_codes || '').split(',').map(c => c.trim());
+                    const codes = (t.course_codes || '').split(',').map(c => c);
                     if (codes.includes(courseCode.trim())) { found = true; break; }
                 }

[NoCoverage] BlockStatement
backend/dataService.js:180:60
                 let found = false;
                 for (const t of allTeachers) {
                     const codes = (t.course_codes || '').split(',').map(c => c.trim());
-                    if (codes.includes(courseCode.trim())) { found = true; break; }
+                    if (codes.includes(courseCode.trim())) {}
                 }
                 if (!found) throw new Error('Class not found. Please check the course code.');

[NoCoverage] BooleanLiteral
backend/dataService.js:180:70
                 let found = false;
                 for (const t of allTeachers) {
                     const codes = (t.course_codes || '').split(',').map(c => c.trim());
-                    if (codes.includes(courseCode.trim())) { found = true; break; }
+                    if (codes.includes(courseCode.trim())) { found = false; break; }
                 }
                 if (!found) throw new Error('Class not found. Please check the course code.');

[NoCoverage] BooleanLiteral
backend/dataService.js:182:21
                     const codes = (t.course_codes || '').split(',').map(c => c.trim());
                     if (codes.includes(courseCode.trim())) { found = true; break; }
                 }
-                if (!found) throw new Error('Class not found. Please check the course code.');
+                if (found) throw new Error('Class not found. Please check the course code.');
             }
 

[NoCoverage] ConditionalExpression
backend/dataService.js:182:21
                     const codes = (t.course_codes || '').split(',').map(c => c.trim());
                     if (codes.includes(courseCode.trim())) { found = true; break; }
                 }
-                if (!found) throw new Error('Class not found. Please check the course code.');
+                if (false) throw new Error('Class not found. Please check the course code.');
             }
 

[Killed] LogicalOperator
backend/dataService.js:186:17
             }
 
             // Check password if class has one
-            if (cls && cls.password && cls.password.trim()) {
+            if (cls || cls.password && cls.password.trim()) {
                 if (!password || password !== cls.password) {
                     throw new Error('Incorrect class password');
killedBy: APK Portal API Integration Tests Classroom & Assignment Module should allow student to join a class with password
statusReason: expected 400 to equal 200

[Killed] LogicalOperator
backend/dataService.js:186:17
             }
 
             // Check password if class has one
-            if (cls && cls.password && cls.password.trim()) {
+            if (cls && cls.password || cls.password.trim()) {
                 if (!password || password !== cls.password) {
                     throw new Error('Incorrect class password');
killedBy: APK Portal API Integration Tests Classroom & Assignment Module should allow student to join a class with password
statusReason: Invalid value "undefined" for header "Authorization"

[Killed] ConditionalExpression
backend/dataService.js:187:21
 
             // Check password if class has one
             if (cls && cls.password && cls.password.trim()) {
-                if (!password || password !== cls.password) {
+                if (true) {
                     throw new Error('Incorrect class password');
                 }
killedBy: APK Portal API Integration Tests Classroom & Assignment Module should allow student to join a class with password
statusReason: Invalid value "undefined" for header "Authorization"

[Killed] ConditionalExpression
backend/dataService.js:187:21
 
             // Check password if class has one
             if (cls && cls.password && cls.password.trim()) {
-                if (!password || password !== cls.password) {
+                if (false) {
                     throw new Error('Incorrect class password');
                 }
killedBy: APK Portal API Integration Tests Classroom & Assignment Module should allow student to join a class with password
statusReason: expected 400 to equal 200

[Killed] StringLiteral
backend/dataService.js:188:37
             // Check password if class has one
             if (cls && cls.password && cls.password.trim()) {
                 if (!password || password !== cls.password) {
-                    throw new Error('Incorrect class password');
+                    throw new Error("");
                 }
             }
killedBy: APK Portal API Integration Tests Classroom & Assignment Module should fail if student joins with wrong password
statusReason: expected 'User not found' to equal 'Incorrect class password'

[Killed] LogicalOperator
backend/dataService.js:193:28
             }
 
             // Check if already enrolled
-            const codes = (user.course_codes || '').split(',').filter(c => c.trim());
+            const codes = (user.course_codes && '').split(',').filter(c => c.trim());
             if (codes.includes(courseCode.trim())) throw new Error('You are already in this class');
 
killedBy: APK Portal API Integration Tests Classroom & Assignment Module should allow student to join a class with password
statusReason: expected 400 to equal 200

[Killed] ArrowFunction
backend/dataService.js:193:71
             }
 
             // Check if already enrolled
-            const codes = (user.course_codes || '').split(',').filter(c => c.trim());
+            const codes = (user.course_codes || '').split(',').filter(() => undefined);
             if (codes.includes(courseCode.trim())) throw new Error('You are already in this class');
 
killedBy: APK Portal API Integration Tests Classroom & Assignment Module should allow student to join a class with password
statusReason: Invalid value "undefined" for header "Authorization"

[Killed] MethodExpression
backend/dataService.js:194:32
 
             // Check if already enrolled
             const codes = (user.course_codes || '').split(',').filter(c => c.trim());
-            if (codes.includes(courseCode.trim())) throw new Error('You are already in this class');
+            if (codes.includes(courseCode)) throw new Error('You are already in this class');
 
             codes.push(courseCode.trim());
killedBy: APK Portal API Integration Tests Classroom & Assignment Module should allow student to join a class with password
statusReason: expected 400 to equal 200

[Killed] ConditionalExpression
backend/dataService.js:194:17
 
             // Check if already enrolled
             const codes = (user.course_codes || '').split(',').filter(c => c.trim());
-            if (codes.includes(courseCode.trim())) throw new Error('You are already in this class');
+            if (false) throw new Error('You are already in this class');
 
             codes.push(courseCode.trim());
killedBy: APK Portal API Integration Tests Classroom & Assignment Module should allow student to join a class with password
statusReason: Invalid value "undefined" for header "Authorization"

[Killed] MethodExpression
backend/dataService.js:196:24
             const codes = (user.course_codes || '').split(',').filter(c => c.trim());
             if (codes.includes(courseCode.trim())) throw new Error('You are already in this class');
 
-            codes.push(courseCode.trim());
+            codes.push(courseCode);
             this.db.prepare('UPDATE users SET course_codes = ? WHERE id = ?').run(codes.join(','), parseInt(userId));
 
killedBy: APK Portal API Integration Tests Classroom & Assignment Module should allow student to join a class with password
statusReason: Invalid value "undefined" for header "Authorization"

[Killed] MethodExpression
backend/dataService.js:199:34
             codes.push(courseCode.trim());
             this.db.prepare('UPDATE users SET course_codes = ? WHERE id = ?').run(codes.join(','), parseInt(userId));
 
-            return { courseCode: courseCode.trim(), message: 'Joined class successfully' };
+            return { courseCode: courseCode, message: 'Joined class successfully' };
         } catch (error) {
             console.error('Error joining class:', error);
killedBy: APK Portal API Integration Tests Classroom & Assignment Module should allow student to join a class with password
statusReason: Invalid value "undefined" for header "Authorization"

[Killed] BlockStatement
backend/dataService.js:200:25
             this.db.prepare('UPDATE users SET course_codes = ? WHERE id = ?').run(codes.join(','), parseInt(userId));
 
             return { courseCode: courseCode.trim(), message: 'Joined class successfully' };
-        } catch (error) {
-            console.error('Error joining class:', error);
-            throw error;
-        }
+        } catch (error) {}
     }
 
killedBy: APK Portal API Integration Tests Classroom & Assignment Module should fail if student joins with wrong password
statusReason: Invalid value "undefined" for header "Authorization"

[NoCoverage] BlockStatement
backend/dataService.js:206:28
         }
     }
 
-    getUserClasses(userId) {
-        try {
-            const user = this.getUserById(userId);
-            if (!user) throw new Error('User not found');
-            const codes = (user.course_codes || '').split(',').filter(c => c.trim());
-            return codes.map(code => {
-                const cls = this.db.prepare('SELECT password FROM classes WHERE course_code = ?').get(code);
-                return { courseCode: code, hasPassword: !!(cls && cls.password && cls.password.trim()) };
-            });
-        } catch (error) {
-            console.error('Error getting classes:', error);
-            throw error;
-        }
-    }
+    getUserClasses(userId) {}
 
     getClassPassword(courseCode, teacherId) {

[NoCoverage] BlockStatement
backend/dataService.js:207:13
     }
 
     getUserClasses(userId) {
-        try {
-            const user = this.getUserById(userId);
-            if (!user) throw new Error('User not found');
-            const codes = (user.course_codes || '').split(',').filter(c => c.trim());
-            return codes.map(code => {
-                const cls = this.db.prepare('SELECT password FROM classes WHERE course_code = ?').get(code);
-                return { courseCode: code, hasPassword: !!(cls && cls.password && cls.password.trim()) };
-            });
-        } catch (error) {
+        try {} catch (error) {
             console.error('Error getting classes:', error);
             throw error;

[NoCoverage] MethodExpression
backend/dataService.js:210:76
         try {
             const user = this.getUserById(userId);
             if (!user) throw new Error('User not found');
-            const codes = (user.course_codes || '').split(',').filter(c => c.trim());
+            const codes = (user.course_codes || '').split(',').filter(c => c);
             return codes.map(code => {
                 const cls = this.db.prepare('SELECT password FROM classes WHERE course_code = ?').get(code);

[NoCoverage] ArrowFunction
backend/dataService.js:210:71
         try {
             const user = this.getUserById(userId);
             if (!user) throw new Error('User not found');
-            const codes = (user.course_codes || '').split(',').filter(c => c.trim());
+            const codes = (user.course_codes || '').split(',').filter(() => undefined);
             return codes.map(code => {
                 const cls = this.db.prepare('SELECT password FROM classes WHERE course_code = ?').get(code);

[NoCoverage] BlockStatement
backend/dataService.js:211:38
             const user = this.getUserById(userId);
             if (!user) throw new Error('User not found');
             const codes = (user.course_codes || '').split(',').filter(c => c.trim());
-            return codes.map(code => {
-                const cls = this.db.prepare('SELECT password FROM classes WHERE course_code = ?').get(code);
-                return { courseCode: code, hasPassword: !!(cls && cls.password && cls.password.trim()) };
-            });
+            return codes.map(code => {});
         } catch (error) {
             console.error('Error getting classes:', error);

[NoCoverage] BooleanLiteral
backend/dataService.js:213:57
             const codes = (user.course_codes || '').split(',').filter(c => c.trim());
             return codes.map(code => {
                 const cls = this.db.prepare('SELECT password FROM classes WHERE course_code = ?').get(code);
-                return { courseCode: code, hasPassword: !!(cls && cls.password && cls.password.trim()) };
+                return { courseCode: code, hasPassword: !(cls && cls.password && cls.password.trim()) };
             });
         } catch (error) {

[NoCoverage] LogicalOperator
backend/dataService.js:213:60
             const codes = (user.course_codes || '').split(',').filter(c => c.trim());
             return codes.map(code => {
                 const cls = this.db.prepare('SELECT password FROM classes WHERE course_code = ?').get(code);
-                return { courseCode: code, hasPassword: !!(cls && cls.password && cls.password.trim()) };
+                return { courseCode: code, hasPassword: !!(cls || cls.password && cls.password.trim()) };
             });
         } catch (error) {

[NoCoverage] BlockStatement
backend/dataService.js:215:25
                 const cls = this.db.prepare('SELECT password FROM classes WHERE course_code = ?').get(code);
                 return { courseCode: code, hasPassword: !!(cls && cls.password && cls.password.trim()) };
             });
-        } catch (error) {
-            console.error('Error getting classes:', error);
-            throw error;
-        }
+        } catch (error) {}
     }
 

[NoCoverage] StringLiteral
backend/dataService.js:216:27
                 return { courseCode: code, hasPassword: !!(cls && cls.password && cls.password.trim()) };
             });
         } catch (error) {
-            console.error('Error getting classes:', error);
+            console.error("", error);
             throw error;
         }

[NoCoverage] BlockStatement
backend/dataService.js:221:45
         }
     }
 
-    getClassPassword(courseCode, teacherId) {
-        const cls = this.db.prepare('SELECT * FROM classes WHERE course_code = ? AND teacher_id = ?').get(courseCode.trim(), parseInt(teacherId));
-        if (!cls) throw new Error('Class not found or not your class');
-        return cls.password || '';
-    }
+    getClassPassword(courseCode, teacherId) {}
 
     updateClassPassword(courseCode, teacherId, newPassword) {

[NoCoverage] MethodExpression
backend/dataService.js:222:107
     }
 
     getClassPassword(courseCode, teacherId) {
-        const cls = this.db.prepare('SELECT * FROM classes WHERE course_code = ? AND teacher_id = ?').get(courseCode.trim(), parseInt(teacherId));
+        const cls = this.db.prepare('SELECT * FROM classes WHERE course_code = ? AND teacher_id = ?').get(courseCode, parseInt(teacherId));
         if (!cls) throw new Error('Class not found or not your class');
         return cls.password || '';

[NoCoverage] StringLiteral
backend/dataService.js:222:37
     }
 
     getClassPassword(courseCode, teacherId) {
-        const cls = this.db.prepare('SELECT * FROM classes WHERE course_code = ? AND teacher_id = ?').get(courseCode.trim(), parseInt(teacherId));
+        const cls = this.db.prepare("").get(courseCode.trim(), parseInt(teacherId));
         if (!cls) throw new Error('Class not found or not your class');
         return cls.password || '';

[NoCoverage] ConditionalExpression
backend/dataService.js:223:13
 
     getClassPassword(courseCode, teacherId) {
         const cls = this.db.prepare('SELECT * FROM classes WHERE course_code = ? AND teacher_id = ?').get(courseCode.trim(), parseInt(teacherId));
-        if (!cls) throw new Error('Class not found or not your class');
+        if (false) throw new Error('Class not found or not your class');
         return cls.password || '';
     }

[NoCoverage] ConditionalExpression
backend/dataService.js:223:13
 
     getClassPassword(courseCode, teacherId) {
         const cls = this.db.prepare('SELECT * FROM classes WHERE course_code = ? AND teacher_id = ?').get(courseCode.trim(), parseInt(teacherId));
-        if (!cls) throw new Error('Class not found or not your class');
+        if (true) throw new Error('Class not found or not your class');
         return cls.password || '';
     }

[NoCoverage] ConditionalExpression
backend/dataService.js:224:16
     getClassPassword(courseCode, teacherId) {
         const cls = this.db.prepare('SELECT * FROM classes WHERE course_code = ? AND teacher_id = ?').get(courseCode.trim(), parseInt(teacherId));
         if (!cls) throw new Error('Class not found or not your class');
-        return cls.password || '';
+        return false;
     }
 

[NoCoverage] ConditionalExpression
backend/dataService.js:224:16
     getClassPassword(courseCode, teacherId) {
         const cls = this.db.prepare('SELECT * FROM classes WHERE course_code = ? AND teacher_id = ?').get(courseCode.trim(), parseInt(teacherId));
         if (!cls) throw new Error('Class not found or not your class');
-        return cls.password || '';
+        return true;
     }
 

[NoCoverage] BlockStatement
backend/dataService.js:227:61
         return cls.password || '';
     }
 
-    updateClassPassword(courseCode, teacherId, newPassword) {
-        const cls = this.db.prepare('SELECT id FROM classes WHERE course_code = ? AND teacher_id = ?').get(courseCode.trim(), parseInt(teacherId));
-        if (!cls) throw new Error('Class not found or not your class');
-        this.db.prepare('UPDATE classes SET password = ? WHERE id = ?').run(newPassword, cls.id);
-        return { message: 'Password updated' };
-    }
+    updateClassPassword(courseCode, teacherId, newPassword) {}
 
     // ============ ASSIGNMENT / FILE METHODS ============
