[NoCoverage] MethodExpression
backend/dataService.js:228:108
     }
 
     updateClassPassword(courseCode, teacherId, newPassword) {
-        const cls = this.db.prepare('SELECT id FROM classes WHERE course_code = ? AND teacher_id = ?').get(courseCode.trim(), parseInt(teacherId));
+        const cls = this.db.prepare('SELECT id FROM classes WHERE course_code = ? AND teacher_id = ?').get(courseCode, parseInt(teacherId));
         if (!cls) throw new Error('Class not found or not your class');
         this.db.prepare('UPDATE classes SET password = ? WHERE id = ?').run(newPassword, cls.id);

[NoCoverage] BooleanLiteral
backend/dataService.js:229:13
 
     updateClassPassword(courseCode, teacherId, newPassword) {
         const cls = this.db.prepare('SELECT id FROM classes WHERE course_code = ? AND teacher_id = ?').get(courseCode.trim(), parseInt(teacherId));
-        if (!cls) throw new Error('Class not found or not your class');
+        if (cls) throw new Error('Class not found or not your class');
         this.db.prepare('UPDATE classes SET password = ? WHERE id = ?').run(newPassword, cls.id);
         return { message: 'Password updated' };

[NoCoverage] ConditionalExpression
backend/dataService.js:229:13
 
     updateClassPassword(courseCode, teacherId, newPassword) {
         const cls = this.db.prepare('SELECT id FROM classes WHERE course_code = ? AND teacher_id = ?').get(courseCode.trim(), parseInt(teacherId));
-        if (!cls) throw new Error('Class not found or not your class');
+        if (true) throw new Error('Class not found or not your class');
         this.db.prepare('UPDATE classes SET password = ? WHERE id = ?').run(newPassword, cls.id);
         return { message: 'Password updated' };

[NoCoverage] StringLiteral
backend/dataService.js:231:27
         const cls = this.db.prepare('SELECT id FROM classes WHERE course_code = ? AND teacher_id = ?').get(courseCode.trim(), parseInt(teacherId));
         if (!cls) throw new Error('Class not found or not your class');
         this.db.prepare('UPDATE classes SET password = ? WHERE id = ?').run(newPassword, cls.id);
-        return { message: 'Password updated' };
+        return { message: "" };
     }
 

[NoCoverage] BlockStatement
backend/dataService.js:236:37
 
     // ============ ASSIGNMENT / FILE METHODS ============
 
-    getClassAssignments(courseCode) {
-        try {
-            const stmt = this.db.prepare(`
-                SELECT f.id, f.filename, f.user_id, f.upload_date, f.saved_name, f.course_code, f.deadline, f.assignment_password,
-                       u.name as uploader_name, u.role as uploader_role
-                FROM files f
-                LEFT JOIN users u ON f.user_id = u.id
-                WHERE f.course_code = ? AND u.role = 'teacher' AND f.assignment_file_id IS NULL
-                ORDER BY f.upload_date DESC
-            `);
-            return stmt.all(courseCode.trim());
-        } catch (error) {
-            console.error('Error getting assignments:', error);
-            throw error;
-        }
-    }
+    getClassAssignments(courseCode) {}
 
     getAssignmentSubmissions(assignmentFileId) {

[NoCoverage] BlockStatement
backend/dataService.js:237:13
     // ============ ASSIGNMENT / FILE METHODS ============
 
     getClassAssignments(courseCode) {
-        try {
-            const stmt = this.db.prepare(`
-                SELECT f.id, f.filename, f.user_id, f.upload_date, f.saved_name, f.course_code, f.deadline, f.assignment_password,
-                       u.name as uploader_name, u.role as uploader_role
-                FROM files f
-                LEFT JOIN users u ON f.user_id = u.id
-                WHERE f.course_code = ? AND u.role = 'teacher' AND f.assignment_file_id IS NULL
-                ORDER BY f.upload_date DESC
-            `);
-            return stmt.all(courseCode.trim());
-        } catch (error) {
+        try {} catch (error) {
             console.error('Error getting assignments:', error);
             throw error;

[NoCoverage] MethodExpression
backend/dataService.js:246:29
                 WHERE f.course_code = ? AND u.role = 'teacher' AND f.assignment_file_id IS NULL
                 ORDER BY f.upload_date DESC
             `);
-            return stmt.all(courseCode.trim());
+            return stmt.all(courseCode);
         } catch (error) {
             console.error('Error getting assignments:', error);

[NoCoverage] BlockStatement
backend/dataService.js:247:25
                 ORDER BY f.upload_date DESC
             `);
             return stmt.all(courseCode.trim());
-        } catch (error) {
-            console.error('Error getting assignments:', error);
-            throw error;
-        }
+        } catch (error) {}
     }
 

[NoCoverage] BlockStatement
backend/dataService.js:253:48
         }
     }
 
-    getAssignmentSubmissions(assignmentFileId) {
-        try {
-            const stmt = this.db.prepare(`
-                SELECT f.id, f.filename, f.user_id, f.upload_date, f.saved_name, f.course_code, f.ip_address,
-                       u.name as uploader_name, u.role as uploader_role
-                FROM files f
-                LEFT JOIN users u ON f.user_id = u.id
-                WHERE f.assignment_file_id = ?
-                ORDER BY f.upload_date DESC
-            `);
-            return stmt.all(parseInt(assignmentFileId));
-        } catch (error) {
-            console.error('Error getting submissions:', error);
-            throw error;
-        }
-    }
+    getAssignmentSubmissions(assignmentFileId) {}
 
     getUserSubmissions(userId) {

[NoCoverage] BlockStatement
backend/dataService.js:254:13
     }
 
     getAssignmentSubmissions(assignmentFileId) {
-        try {
-            const stmt = this.db.prepare(`
-                SELECT f.id, f.filename, f.user_id, f.upload_date, f.saved_name, f.course_code, f.ip_address,
-                       u.name as uploader_name, u.role as uploader_role
-                FROM files f
-                LEFT JOIN users u ON f.user_id = u.id
-                WHERE f.assignment_file_id = ?
-                ORDER BY f.upload_date DESC
-            `);
-            return stmt.all(parseInt(assignmentFileId));
-        } catch (error) {
+        try {} catch (error) {
             console.error('Error getting submissions:', error);
             throw error;

[NoCoverage] BlockStatement
backend/dataService.js:264:25
                 ORDER BY f.upload_date DESC
             `);
             return stmt.all(parseInt(assignmentFileId));
-        } catch (error) {
-            console.error('Error getting submissions:', error);
-            throw error;
-        }
+        } catch (error) {}
     }
 

[NoCoverage] StringLiteral
backend/dataService.js:265:27
             `);
             return stmt.all(parseInt(assignmentFileId));
         } catch (error) {
-            console.error('Error getting submissions:', error);
+            console.error("", error);
             throw error;
         }

[NoCoverage] BlockStatement
backend/dataService.js:270:32
         }
     }
 
-    getUserSubmissions(userId) {
-        try {
-            const stmt = this.db.prepare(`
-                SELECT f.id, f.filename, f.user_id, f.upload_date, f.saved_name, f.course_code, f.assignment_file_id,
-                       u.name as uploader_name,
-                       af.filename as assignment_name
-                FROM files f
-                LEFT JOIN users u ON f.user_id = u.id
-                LEFT JOIN files af ON f.assignment_file_id = af.id
-                WHERE f.user_id = ? AND f.assignment_file_id IS NOT NULL
-                ORDER BY f.upload_date DESC
-            `);
-            return stmt.all(parseInt(userId));
-        } catch (error) {
-            console.error('Error getting user submissions:', error);
-            throw error;
-        }
-    }
+    getUserSubmissions(userId) {}
 
     // Get ALL submissions for a class (for zip download)

[NoCoverage] BlockStatement
backend/dataService.js:271:13
     }
 
     getUserSubmissions(userId) {
-        try {
-            const stmt = this.db.prepare(`
-                SELECT f.id, f.filename, f.user_id, f.upload_date, f.saved_name, f.course_code, f.assignment_file_id,
-                       u.name as uploader_name,
-                       af.filename as assignment_name
-                FROM files f
-                LEFT JOIN users u ON f.user_id = u.id
-                LEFT JOIN files af ON f.assignment_file_id = af.id
-                WHERE f.user_id = ? AND f.assignment_file_id IS NOT NULL
-                ORDER BY f.upload_date DESC
-            `);
-            return stmt.all(parseInt(userId));
-        } catch (error) {
+        try {} catch (error) {
             console.error('Error getting user submissions:', error);
             throw error;

[NoCoverage] StringLiteral
backend/dataService.js:272:42
 
     getUserSubmissions(userId) {
         try {
-            const stmt = this.db.prepare(`
-                SELECT f.id, f.filename, f.user_id, f.upload_date, f.saved_name, f.course_code, f.assignment_file_id,
-                       u.name as uploader_name,
-                       af.filename as assignment_name
-                FROM files f
-                LEFT JOIN users u ON f.user_id = u.id
-                LEFT JOIN files af ON f.assignment_file_id = af.id
-                WHERE f.user_id = ? AND f.assignment_file_id IS NOT NULL
-                ORDER BY f.upload_date DESC
-            `);
+            const stmt = this.db.prepare(``);
             return stmt.all(parseInt(userId));
         } catch (error) {

[NoCoverage] BlockStatement
backend/dataService.js:283:25
                 ORDER BY f.upload_date DESC
             `);
             return stmt.all(parseInt(userId));
-        } catch (error) {
-            console.error('Error getting user submissions:', error);
-            throw error;
-        }
+        } catch (error) {}
     }
 

[NoCoverage] BlockStatement
backend/dataService.js:290:37
     }
 
     // Get ALL submissions for a class (for zip download)
-    getClassSubmissions(courseCode) {
-        try {
-            const stmt = this.db.prepare(`
-                SELECT f.id, f.filename, f.user_id, f.upload_date, f.saved_name, f.course_code, f.assignment_file_id, f.ip_address,
-                       u.name as uploader_name, u.role as uploader_role,
-                       af.filename as assignment_name
-                FROM files f
-                LEFT JOIN users u ON f.user_id = u.id
-                LEFT JOIN files af ON f.assignment_file_id = af.id
-                WHERE f.course_code = ? AND f.assignment_file_id IS NOT NULL
-                ORDER BY af.filename ASC, u.name ASC
-            `);
-            return stmt.all(courseCode.trim());
-        } catch (error) {
-            console.error('Error getting class submissions:', error);
-            throw error;
-        }
-    }
+    getClassSubmissions(courseCode) {}
 
     setAssignmentDeadline(fileId, teacherId, deadline) {

[NoCoverage] BlockStatement
backend/dataService.js:291:13
 
     // Get ALL submissions for a class (for zip download)
     getClassSubmissions(courseCode) {
-        try {
-            const stmt = this.db.prepare(`
-                SELECT f.id, f.filename, f.user_id, f.upload_date, f.saved_name, f.course_code, f.assignment_file_id, f.ip_address,
-                       u.name as uploader_name, u.role as uploader_role,
-                       af.filename as assignment_name
-                FROM files f
-                LEFT JOIN users u ON f.user_id = u.id
-                LEFT JOIN files af ON f.assignment_file_id = af.id
-                WHERE f.course_code = ? AND f.assignment_file_id IS NOT NULL
-                ORDER BY af.filename ASC, u.name ASC
-            `);
-            return stmt.all(courseCode.trim());
-        } catch (error) {
+        try {} catch (error) {
             console.error('Error getting class submissions:', error);
             throw error;

[NoCoverage] StringLiteral
backend/dataService.js:292:42
     // Get ALL submissions for a class (for zip download)
     getClassSubmissions(courseCode) {
         try {
-            const stmt = this.db.prepare(`
-                SELECT f.id, f.filename, f.user_id, f.upload_date, f.saved_name, f.course_code, f.assignment_file_id, f.ip_address,
-                       u.name as uploader_name, u.role as uploader_role,
-                       af.filename as assignment_name
-                FROM files f
-                LEFT JOIN users u ON f.user_id = u.id
-                LEFT JOIN files af ON f.assignment_file_id = af.id
-                WHERE f.course_code = ? AND f.assignment_file_id IS NOT NULL
-                ORDER BY af.filename ASC, u.name ASC
-            `);
+            const stmt = this.db.prepare(``);
             return stmt.all(courseCode.trim());
         } catch (error) {

[NoCoverage] BlockStatement
backend/dataService.js:303:25
                 ORDER BY af.filename ASC, u.name ASC
             `);
             return stmt.all(courseCode.trim());
-        } catch (error) {
-            console.error('Error getting class submissions:', error);
-            throw error;
-        }
+        } catch (error) {}
     }
 

[NoCoverage] StringLiteral
backend/dataService.js:304:27
             `);
             return stmt.all(courseCode.trim());
         } catch (error) {
-            console.error('Error getting class submissions:', error);
+            console.error("", error);
             throw error;
         }

[NoCoverage] BlockStatement
backend/dataService.js:309:56
         }
     }
 
-    setAssignmentDeadline(fileId, teacherId, deadline) {
-        const file = this.db.prepare('SELECT * FROM files WHERE id = ? AND user_id = ?').get(parseInt(fileId), parseInt(teacherId));
-        if (!file) throw new Error('Assignment not found or not yours');
-        this.db.prepare('UPDATE files SET deadline = ? WHERE id = ?').run(deadline, parseInt(fileId));
-        return { message: 'Deadline updated' };
-    }
+    setAssignmentDeadline(fileId, teacherId, deadline) {}
 
     setAssignmentPassword(fileId, teacherId, password) {

[NoCoverage] StringLiteral
backend/dataService.js:310:38
     }
 
     setAssignmentDeadline(fileId, teacherId, deadline) {
-        const file = this.db.prepare('SELECT * FROM files WHERE id = ? AND user_id = ?').get(parseInt(fileId), parseInt(teacherId));
+        const file = this.db.prepare("").get(parseInt(fileId), parseInt(teacherId));
         if (!file) throw new Error('Assignment not found or not yours');
         this.db.prepare('UPDATE files SET deadline = ? WHERE id = ?').run(deadline, parseInt(fileId));

[NoCoverage] ConditionalExpression
backend/dataService.js:311:13
 
     setAssignmentDeadline(fileId, teacherId, deadline) {
         const file = this.db.prepare('SELECT * FROM files WHERE id = ? AND user_id = ?').get(parseInt(fileId), parseInt(teacherId));
-        if (!file) throw new Error('Assignment not found or not yours');
+        if (false) throw new Error('Assignment not found or not yours');
         this.db.prepare('UPDATE files SET deadline = ? WHERE id = ?').run(deadline, parseInt(fileId));
         return { message: 'Deadline updated' };

[NoCoverage] BooleanLiteral
backend/dataService.js:311:13
 
     setAssignmentDeadline(fileId, teacherId, deadline) {
         const file = this.db.prepare('SELECT * FROM files WHERE id = ? AND user_id = ?').get(parseInt(fileId), parseInt(teacherId));
-        if (!file) throw new Error('Assignment not found or not yours');
+        if (file) throw new Error('Assignment not found or not yours');
         this.db.prepare('UPDATE files SET deadline = ? WHERE id = ?').run(deadline, parseInt(fileId));
         return { message: 'Deadline updated' };

[NoCoverage] BlockStatement
backend/dataService.js:316:56
         return { message: 'Deadline updated' };
     }
 
-    setAssignmentPassword(fileId, teacherId, password) {
-        const file = this.db.prepare('SELECT * FROM files WHERE id = ? AND user_id = ?').get(parseInt(fileId), parseInt(teacherId));
-        if (!file) throw new Error('Assignment not found or not yours');
-        this.db.prepare('UPDATE files SET assignment_password = ? WHERE id = ?').run(password || '', parseInt(fileId));
-        return { message: 'Assignment password updated' };
-    }
+    setAssignmentPassword(fileId, teacherId, password) {}
 
     getAssignmentById(fileId) {

[NoCoverage] StringLiteral
backend/dataService.js:317:38
     }
 
     setAssignmentPassword(fileId, teacherId, password) {
-        const file = this.db.prepare('SELECT * FROM files WHERE id = ? AND user_id = ?').get(parseInt(fileId), parseInt(teacherId));
+        const file = this.db.prepare("").get(parseInt(fileId), parseInt(teacherId));
         if (!file) throw new Error('Assignment not found or not yours');
         this.db.prepare('UPDATE files SET assignment_password = ? WHERE id = ?').run(password || '', parseInt(fileId));

[NoCoverage] ConditionalExpression
backend/dataService.js:318:13
 
     setAssignmentPassword(fileId, teacherId, password) {
         const file = this.db.prepare('SELECT * FROM files WHERE id = ? AND user_id = ?').get(parseInt(fileId), parseInt(teacherId));
-        if (!file) throw new Error('Assignment not found or not yours');
+        if (true) throw new Error('Assignment not found or not yours');
         this.db.prepare('UPDATE files SET assignment_password = ? WHERE id = ?').run(password || '', parseInt(fileId));
         return { message: 'Assignment password updated' };

[NoCoverage] ConditionalExpression
backend/dataService.js:319:86
     setAssignmentPassword(fileId, teacherId, password) {
         const file = this.db.prepare('SELECT * FROM files WHERE id = ? AND user_id = ?').get(parseInt(fileId), parseInt(teacherId));
         if (!file) throw new Error('Assignment not found or not yours');
-        this.db.prepare('UPDATE files SET assignment_password = ? WHERE id = ?').run(password || '', parseInt(fileId));
+        this.db.prepare('UPDATE files SET assignment_password = ? WHERE id = ?').run(true, parseInt(fileId));
         return { message: 'Assignment password updated' };
     }

[NoCoverage] LogicalOperator
backend/dataService.js:319:86
     setAssignmentPassword(fileId, teacherId, password) {
         const file = this.db.prepare('SELECT * FROM files WHERE id = ? AND user_id = ?').get(parseInt(fileId), parseInt(teacherId));
         if (!file) throw new Error('Assignment not found or not yours');
-        this.db.prepare('UPDATE files SET assignment_password = ? WHERE id = ?').run(password || '', parseInt(fileId));
+        this.db.prepare('UPDATE files SET assignment_password = ? WHERE id = ?').run(password && '', parseInt(fileId));
         return { message: 'Assignment password updated' };
     }

[NoCoverage] BlockStatement
backend/dataService.js:323:31
         return { message: 'Assignment password updated' };
     }
 
-    getAssignmentById(fileId) {
-        return this.db.prepare('SELECT * FROM files WHERE id = ?').get(parseInt(fileId));
-    }
+    getAssignmentById(fileId) {}
 
     // Check if student has submitted to an assignment (for password bypass on download)

[NoCoverage] BlockStatement
backend/dataService.js:328:51
     }
 
     // Check if student has submitted to an assignment (for password bypass on download)
-    hasStudentSubmitted(userId, assignmentFileId) {
-        const sub = this.db.prepare('SELECT id FROM files WHERE user_id = ? AND assignment_file_id = ?').get(parseInt(userId), parseInt(assignmentFileId));
-        return !!sub;
-    }
+    hasStudentSubmitted(userId, assignmentFileId) {}
 
     addFile(filename, userId, savedName, courseCode, ipAddress, assignmentFileId = null, deadline = null, assignmentPassword = '') {

[NoCoverage] BooleanLiteral
backend/dataService.js:330:16
     // Check if student has submitted to an assignment (for password bypass on download)
     hasStudentSubmitted(userId, assignmentFileId) {
         const sub = this.db.prepare('SELECT id FROM files WHERE user_id = ? AND assignment_file_id = ?').get(parseInt(userId), parseInt(assignmentFileId));
-        return !!sub;
+        return !sub;
     }
 

[NoCoverage] BlockStatement
backend/dataService.js:333:132
         return !!sub;
     }
 
-    addFile(filename, userId, savedName, courseCode, ipAddress, assignmentFileId = null, deadline = null, assignmentPassword = '') {
-        try {
-            const userIdInt = parseInt(userId);
-            const uploadDate = new Date().toISOString();
-
-            const stmt = this.db.prepare(`
-                INSERT INTO files (filename, user_id, upload_date, saved_name, course_code, ip_address, assignment_file_id, deadline, assignment_password)
-                VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
-            `);
-            const info = stmt.run(filename, userIdInt, uploadDate, savedName, courseCode, ipAddress, assignmentFileId, deadline, assignmentPassword);
-
-            return {
-                id: info.lastInsertRowid, filename, user_id: userIdInt, upload_date: uploadDate,
-                saved_name: savedName, course_code: courseCode, ip_address: ipAddress,
-                assignment_file_id: assignmentFileId, deadline, assignment_password: assignmentPassword
-            };
-        } catch (error) {
-            console.error('Error adding file:', error);
-            throw new Error('Failed to add file to database');
-        }
-    }
+    addFile(filename, userId, savedName, courseCode, ipAddress, assignmentFileId = null, deadline = null, assignmentPassword = '') {}
 
     getFiles(userId, role) {

[NoCoverage] BlockStatement
backend/dataService.js:334:13
     }
 
     addFile(filename, userId, savedName, courseCode, ipAddress, assignmentFileId = null, deadline = null, assignmentPassword = '') {
-        try {
-            const userIdInt = parseInt(userId);
-            const uploadDate = new Date().toISOString();
-
-            const stmt = this.db.prepare(`
-                INSERT INTO files (filename, user_id, upload_date, saved_name, course_code, ip_address, assignment_file_id, deadline, assignment_password)
-                VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
-            `);
-            const info = stmt.run(filename, userIdInt, uploadDate, savedName, courseCode, ipAddress, assignmentFileId, deadline, assignmentPassword);
-
-            return {
-                id: info.lastInsertRowid, filename, user_id: userIdInt, upload_date: uploadDate,
-                saved_name: savedName, course_code: courseCode, ip_address: ipAddress,
-                assignment_file_id: assignmentFileId, deadline, assignment_password: assignmentPassword
-            };
-        } catch (error) {
+        try {} catch (error) {
             console.error('Error adding file:', error);
             throw new Error('Failed to add file to database');

[NoCoverage] StringLiteral
backend/dataService.js:338:42
             const userIdInt = parseInt(userId);
             const uploadDate = new Date().toISOString();
 
-            const stmt = this.db.prepare(`
-                INSERT INTO files (filename, user_id, upload_date, saved_name, course_code, ip_address, assignment_file_id, deadline, assignment_password)
-                VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
-            `);
+            const stmt = this.db.prepare(``);
             const info = stmt.run(filename, userIdInt, uploadDate, savedName, courseCode, ipAddress, assignmentFileId, deadline, assignmentPassword);
 

[NoCoverage] BlockStatement
backend/dataService.js:349:25
                 saved_name: savedName, course_code: courseCode, ip_address: ipAddress,
                 assignment_file_id: assignmentFileId, deadline, assignment_password: assignmentPassword
             };
-        } catch (error) {
-            console.error('Error adding file:', error);
-            throw new Error('Failed to add file to database');
-        }
+        } catch (error) {}
     }
 

[NoCoverage] StringLiteral
backend/dataService.js:350:27
                 assignment_file_id: assignmentFileId, deadline, assignment_password: assignmentPassword
             };
         } catch (error) {
-            console.error('Error adding file:', error);
+            console.error("", error);
             throw new Error('Failed to add file to database');
         }

[NoCoverage] BlockStatement
backend/dataService.js:356:13
     }
 
     getFiles(userId, role) {
-        try {
-            const userIdInt = parseInt(userId);
-            const currentUser = this.db.prepare('SELECT course_codes FROM users WHERE id = ?').get(userIdInt);
-            const userCourseCodes = currentUser && currentUser.course_codes ? currentUser.course_codes.split(',') : [];
-
-            const allFilesStmt = this.db.prepare(`
-                SELECT f.id, f.filename, f.user_id, f.upload_date, f.saved_name, f.course_code, f.ip_address, f.assignment_file_id, f.deadline, f.assignment_password,
-                       u.name as uploader_name, u.role as uploader_role
-                FROM files f
-                LEFT JOIN users u ON f.user_id = u.id
-            `);
-            const filesWithUserInfo = allFilesStmt.all();
-
-            if (role === 'teacher') {
-                return filesWithUserInfo.filter(file => userCourseCodes.includes(file.course_code));
-            } else {
-                return filesWithUserInfo.filter(file => {
-                    const isOwnFile = file.user_id === userIdInt;
-                    const isTeacherFile = file.uploader_role === 'teacher';
-                    const hasMatchingCourseCode = file.course_code && userCourseCodes.includes(file.course_code);
-                    return isOwnFile || (isTeacherFile && hasMatchingCourseCode);
-                });
-            }
-        } catch (error) {
+        try {} catch (error) {
             console.error('Error getting files:', error);
             throw new Error('Failed to retrieve files');

[NoCoverage] ConditionalExpression
backend/dataService.js:359:37
         try {
             const userIdInt = parseInt(userId);
             const currentUser = this.db.prepare('SELECT course_codes FROM users WHERE id = ?').get(userIdInt);
-            const userCourseCodes = currentUser && currentUser.course_codes ? currentUser.course_codes.split(',') : [];
+            const userCourseCodes = true ? currentUser.course_codes.split(',') : [];
 
             const allFilesStmt = this.db.prepare(`

[NoCoverage] LogicalOperator
backend/dataService.js:359:37
         try {
             const userIdInt = parseInt(userId);
             const currentUser = this.db.prepare('SELECT course_codes FROM users WHERE id = ?').get(userIdInt);
-            const userCourseCodes = currentUser && currentUser.course_codes ? currentUser.course_codes.split(',') : [];
+            const userCourseCodes = currentUser || currentUser.course_codes ? currentUser.course_codes.split(',') : [];
 
             const allFilesStmt = this.db.prepare(`

[NoCoverage] ConditionalExpression
backend/dataService.js:369:17
             `);
             const filesWithUserInfo = allFilesStmt.all();
 
-            if (role === 'teacher') {
+            if (false) {
                 return filesWithUserInfo.filter(file => userCourseCodes.includes(file.course_code));
             } else {

[NoCoverage] ConditionalExpression
backend/dataService.js:369:17
             `);
             const filesWithUserInfo = allFilesStmt.all();
 
-            if (role === 'teacher') {
+            if (true) {
                 return filesWithUserInfo.filter(file => userCourseCodes.includes(file.course_code));
             } else {

[NoCoverage] ArrowFunction
backend/dataService.js:370:49
             const filesWithUserInfo = allFilesStmt.all();
 
             if (role === 'teacher') {
-                return filesWithUserInfo.filter(file => userCourseCodes.includes(file.course_code));
+                return filesWithUserInfo.filter(() => undefined);
             } else {
                 return filesWithUserInfo.filter(file => {

[NoCoverage] MethodExpression
backend/dataService.js:370:24
             const filesWithUserInfo = allFilesStmt.all();
 
             if (role === 'teacher') {
-                return filesWithUserInfo.filter(file => userCourseCodes.includes(file.course_code));
+                return filesWithUserInfo;
             } else {
                 return filesWithUserInfo.filter(file => {

[NoCoverage] BlockStatement
backend/dataService.js:371:20
 
             if (role === 'teacher') {
                 return filesWithUserInfo.filter(file => userCourseCodes.includes(file.course_code));
-            } else {
-                return filesWithUserInfo.filter(file => {
-                    const isOwnFile = file.user_id === userIdInt;
-                    const isTeacherFile = file.uploader_role === 'teacher';
-                    const hasMatchingCourseCode = file.course_code && userCourseCodes.includes(file.course_code);
-                    return isOwnFile || (isTeacherFile && hasMatchingCourseCode);
-                });
-            }
+            } else {}
         } catch (error) {
             console.error('Error getting files:', error);
