[NoCoverage] BlockStatement
backend/dataService.js:372:57
             if (role === 'teacher') {
                 return filesWithUserInfo.filter(file => userCourseCodes.includes(file.course_code));
             } else {
-                return filesWithUserInfo.filter(file => {
-                    const isOwnFile = file.user_id === userIdInt;
-                    const isTeacherFile = file.uploader_role === 'teacher';
-                    const hasMatchingCourseCode = file.course_code && userCourseCodes.includes(file.course_code);
-                    return isOwnFile || (isTeacherFile && hasMatchingCourseCode);
-                });
+                return filesWithUserInfo.filter(file => {});
             }
         } catch (error) {

[NoCoverage] MethodExpression
backend/dataService.js:372:24
             if (role === 'teacher') {
                 return filesWithUserInfo.filter(file => userCourseCodes.includes(file.course_code));
             } else {
-                return filesWithUserInfo.filter(file => {
-                    const isOwnFile = file.user_id === userIdInt;
-                    const isTeacherFile = file.uploader_role === 'teacher';
-                    const hasMatchingCourseCode = file.course_code && userCourseCodes.includes(file.course_code);
-                    return isOwnFile || (isTeacherFile && hasMatchingCourseCode);
-                });
+                return filesWithUserInfo;
             }
         } catch (error) {

[NoCoverage] ConditionalExpression
backend/dataService.js:373:39
                 return filesWithUserInfo.filter(file => userCourseCodes.includes(file.course_code));
             } else {
                 return filesWithUserInfo.filter(file => {
-                    const isOwnFile = file.user_id === userIdInt;
+                    const isOwnFile = false;
                     const isTeacherFile = file.uploader_role === 'teacher';
                     const hasMatchingCourseCode = file.course_code && userCourseCodes.includes(file.course_code);

[NoCoverage] EqualityOperator
backend/dataService.js:373:39
                 return filesWithUserInfo.filter(file => userCourseCodes.includes(file.course_code));
             } else {
                 return filesWithUserInfo.filter(file => {
-                    const isOwnFile = file.user_id === userIdInt;
+                    const isOwnFile = file.user_id !== userIdInt;
                     const isTeacherFile = file.uploader_role === 'teacher';
                     const hasMatchingCourseCode = file.course_code && userCourseCodes.includes(file.course_code);

[NoCoverage] ConditionalExpression
backend/dataService.js:374:43
             } else {
                 return filesWithUserInfo.filter(file => {
                     const isOwnFile = file.user_id === userIdInt;
-                    const isTeacherFile = file.uploader_role === 'teacher';
+                    const isTeacherFile = true;
                     const hasMatchingCourseCode = file.course_code && userCourseCodes.includes(file.course_code);
                     return isOwnFile || (isTeacherFile && hasMatchingCourseCode);

[NoCoverage] ConditionalExpression
backend/dataService.js:374:43
             } else {
                 return filesWithUserInfo.filter(file => {
                     const isOwnFile = file.user_id === userIdInt;
-                    const isTeacherFile = file.uploader_role === 'teacher';
+                    const isTeacherFile = false;
                     const hasMatchingCourseCode = file.course_code && userCourseCodes.includes(file.course_code);
                     return isOwnFile || (isTeacherFile && hasMatchingCourseCode);

[NoCoverage] ConditionalExpression
backend/dataService.js:375:51
                 return filesWithUserInfo.filter(file => {
                     const isOwnFile = file.user_id === userIdInt;
                     const isTeacherFile = file.uploader_role === 'teacher';
-                    const hasMatchingCourseCode = file.course_code && userCourseCodes.includes(file.course_code);
+                    const hasMatchingCourseCode = false;
                     return isOwnFile || (isTeacherFile && hasMatchingCourseCode);
                 });

[NoCoverage] ConditionalExpression
backend/dataService.js:375:51
                 return filesWithUserInfo.filter(file => {
                     const isOwnFile = file.user_id === userIdInt;
                     const isTeacherFile = file.uploader_role === 'teacher';
-                    const hasMatchingCourseCode = file.course_code && userCourseCodes.includes(file.course_code);
+                    const hasMatchingCourseCode = true;
                     return isOwnFile || (isTeacherFile && hasMatchingCourseCode);
                 });

[NoCoverage] ConditionalExpression
backend/dataService.js:376:28
                     const isOwnFile = file.user_id === userIdInt;
                     const isTeacherFile = file.uploader_role === 'teacher';
                     const hasMatchingCourseCode = file.course_code && userCourseCodes.includes(file.course_code);
-                    return isOwnFile || (isTeacherFile && hasMatchingCourseCode);
+                    return false;
                 });
             }

[NoCoverage] LogicalOperator
backend/dataService.js:376:42
                     const isOwnFile = file.user_id === userIdInt;
                     const isTeacherFile = file.uploader_role === 'teacher';
                     const hasMatchingCourseCode = file.course_code && userCourseCodes.includes(file.course_code);
-                    return isOwnFile || (isTeacherFile && hasMatchingCourseCode);
+                    return isOwnFile || (isTeacherFile || hasMatchingCourseCode);
                 });
             }

[NoCoverage] BlockStatement
backend/dataService.js:379:25
                     return isOwnFile || (isTeacherFile && hasMatchingCourseCode);
                 });
             }
-        } catch (error) {
-            console.error('Error getting files:', error);
-            throw new Error('Failed to retrieve files');
-        }
+        } catch (error) {}
     }
 

[NoCoverage] StringLiteral
backend/dataService.js:380:27
                 });
             }
         } catch (error) {
-            console.error('Error getting files:', error);
+            console.error("", error);
             throw new Error('Failed to retrieve files');
         }

[NoCoverage] StringLiteral
backend/dataService.js:381:29
             }
         } catch (error) {
             console.error('Error getting files:', error);
-            throw new Error('Failed to retrieve files');
+            throw new Error("");
         }
     }

[NoCoverage] BlockStatement
backend/dataService.js:385:32
         }
     }
 
-    deleteFile(fileId, userId) {
-        try {
-            const info = this.db.prepare('DELETE FROM files WHERE id = ? AND user_id = ?').run(parseInt(fileId), parseInt(userId));
-            if (info.changes === 0) throw new Error('File not found or not authorized');
-        } catch (error) {
-            console.error('Error deleting file:', error);
-            throw error;
-        }
-    }
+    deleteFile(fileId, userId) {}
 }
 

[NoCoverage] BlockStatement
backend/dataService.js:386:13
     }
 
     deleteFile(fileId, userId) {
-        try {
-            const info = this.db.prepare('DELETE FROM files WHERE id = ? AND user_id = ?').run(parseInt(fileId), parseInt(userId));
-            if (info.changes === 0) throw new Error('File not found or not authorized');
-        } catch (error) {
+        try {} catch (error) {
             console.error('Error deleting file:', error);
             throw error;

[NoCoverage] EqualityOperator
backend/dataService.js:388:17
     deleteFile(fileId, userId) {
         try {
             const info = this.db.prepare('DELETE FROM files WHERE id = ? AND user_id = ?').run(parseInt(fileId), parseInt(userId));
-            if (info.changes === 0) throw new Error('File not found or not authorized');
+            if (info.changes !== 0) throw new Error('File not found or not authorized');
         } catch (error) {
             console.error('Error deleting file:', error);

[NoCoverage] ConditionalExpression
backend/dataService.js:388:17
     deleteFile(fileId, userId) {
         try {
             const info = this.db.prepare('DELETE FROM files WHERE id = ? AND user_id = ?').run(parseInt(fileId), parseInt(userId));
-            if (info.changes === 0) throw new Error('File not found or not authorized');
+            if (false) throw new Error('File not found or not authorized');
         } catch (error) {
             console.error('Error deleting file:', error);

[NoCoverage] BlockStatement
backend/dataService.js:389:25
         try {
             const info = this.db.prepare('DELETE FROM files WHERE id = ? AND user_id = ?').run(parseInt(fileId), parseInt(userId));
             if (info.changes === 0) throw new Error('File not found or not authorized');
-        } catch (error) {
-            console.error('Error deleting file:', error);
-            throw error;
-        }
+        } catch (error) {}
     }
 }
